<?php

//$messages = [
//    'Вам еще рано работать',
//    'Вам еще рабатать и  работать',
//    'Вам пора на пенсию!',
//    'Я удивлен '
//];
//
//$age = mt_rand(0,100);
//echo "---------------- <br>";
//echo " Вам = $age лет  <br>";
//echo $messages [ $age < 18 ? 0 : ($age < 60 ? 1 : ($age < 80 ? 2 : 3))];
//
//echo ($age);

// ---  Второй вариант
//function ff($age)
//{
//    $messages = [
//        'Вам еще рано работать',
//        'Вам еще рабатать и  работать',
//        'Вам пора на пенсию!',
//        'Я удивлен '
//    ];
//    echo "---------------- <br>";
//echo " Вам = $age лет  <br>";
//echo $messages [$age < 18 ? 0 : ($age < 60 ? 1 : ($age < 80 ? 2 : 3))];
//}
//$age = mt_rand(0,100);
//ff($age);

// ---  Cравнение
//$x=4;
//$y=5;
//var_dump($x <> $y);
//echo " x= $x y= $y <br/>";

$x=0;
$y=null;
var_dump($x === $y);
echo " x= $x y= $y <br/>";